In [1]:
import pandas
import numpy

In [2]:
serie = pandas.Series(numpy.arange(4),
                     index=["a","c","d","e"])
serie2 = pandas.Series(numpy.arange(5),
                     index=["a","c","e","f","g"])

In [3]:
print(serie)
print(serie2)

a    0
c    1
d    2
e    3
dtype: int32
a    0
c    1
e    2
f    3
g    4
dtype: int32

In [4]:
serie+serie2 # Suma solo los indices comunes

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [5]:
dataframe = pandas.DataFrame(
            numpy.arange(6).reshape(2,3),
    columns=list("ABC"),
    index=["Mateo","Tomas"]
)
dataframe2 = pandas.DataFrame(
            numpy.arange(9).reshape(3,3),
    columns=list("ACD"),
    index=["Mateo","Cali","Tomas"]
)

In [6]:
print(dataframe)
print(dataframe2)

       A  B  C
Mateo  0  1  2
Tomas  3  4  5
       A  C  D
Mateo  0  1  2
Cali   3  4  5
Tomas  6  7  8

In [7]:
dataframe + dataframe2

         A   B     C   D
Cali   NaN NaN   NaN NaN
Mateo  0.0 NaN   3.0 NaN
Tomas  9.0 NaN  12.0 NaN

In [8]:
dataframe.add(dataframe2, fill_value=0) # se llena con un 0 si en uno de los 2 lados hay un valor

         A    B     C    D
Cali   3.0  NaN   4.0  5.0
Mateo  0.0  1.0   3.0  2.0
Tomas  9.0  4.0  12.0  8.0

In [9]:
1/dataframe

              A     B    C
Mateo       inf  1.00  0.5
Tomas  0.333333  0.25  0.2

In [10]:
dataframe2*3

        A   C   D
Mateo   0   3   6
Cali    9  12  15
Tomas  18  21  24

In [11]:
dataframe.mul(3)

       A   B   C
Mateo  0   3   6
Tomas  9  12  15

In [13]:
dataframe2

       A  C  D
Mateo  0  1  2
Cali   3  4  5
Tomas  6  7  8

In [15]:
serie3=dataframe2.iloc[1]
serie3

A    3
C    4
D    5
Name: Cali, dtype: int32

In [18]:
dataframe2-serie3

       A  C  D
Mateo -3 -3 -3
Cali   0  0  0
Tomas  3  3  3

In [19]:
serie4 = dataframe2["A"]
serie4

Mateo    0
Cali     3
Tomas    6
Name: A, dtype: int32

In [20]:
dataframe2.sub(serie4,axis="index")

       A  C  D
Mateo  0  1  2
Cali   0  1  2
Tomas  0  1  2

## Aplicar una funcion

In [23]:
dataframe3 = pandas.DataFrame(
            numpy.random.randn(4,3),
            columns=list("ABC"),
            index=["Kim","Susana","Mateo","Tomas"]
)
dataframe3

               A         B         C
Kim     0.204011  1.686584 -1.760637
Susana -0.316682 -0.318025  0.276940
Mateo  -0.731033  2.312793 -0.279137
Tomas  -0.088572 -1.178229  1.078586

In [24]:
numpy.abs(dataframe3)

               A         B         C
Kim     0.204011  1.686584  1.760637
Susana  0.316682  0.318025  0.276940
Mateo   0.731033  2.312793  0.279137
Tomas   0.088572  1.178229  1.078586

In [25]:
function = lambda x:x.max()-x.min()

In [26]:
dataframe3.apply(function)

A    0.935044
B    3.491022
C    2.839224
dtype: float64

In [30]:
def function2(x):
    return x*2

In [31]:
dataframe3.apply(function2)

               A         B         C
Kim     0.408021  3.373169 -3.521275
Susana -0.633363 -0.636050  0.553881
Mateo  -1.462066  4.625586 -0.558274
Tomas  -0.177145 -2.356458  2.157173